<?php
namespace app\user\controller;
use think\facade\View;
use think\facade\Request;

use app\common\validate\User as vUser;
use app\common\model\User as mUser;

class Test{
    private $user_nackname_list=['月下伊人醉','寄君曲','云淡风轻','纤云弄巧','十里荒凉胭脂泪','与旧日火葬','只为君回首','昔日女神凤姐','焚音','结发绾袖.','明媚殇','不甚了了','落花摇情满江树','古琵琶的爱情^','君无戏言','莫染尘埃的时光','为伊宽笑颜','凉城旧梦°','散茑捩ら,','晓风残月','写雾词','花木兰','若迈风','笑眼生姿娇','淡然若水','啼红泪','纸风铃つ','伊人笑','一字兰舟','岚荼盛','妃成后后成婢','且共从容','清歌花酒','嫣然若夕','旧城俨然回眸笑','我是雷锋','胭脂血','醉卧君子膝','淫词浪曲','上火的皇帝','醉风吹客衣','北陌深巷','红楼梦魇','勿语','亦惜醉红颜','青丘白浅','古城小巷红尘客','尔笑为红颜','点缀宫妆面','从此江山别','老旧照片','佟湘玉','彼岸花开的太美','歌岛礼矢','良辰','亡妃笑看土皇','古剑奇谭','曲终人散方恨晚','故笙诉离歌','浮华乱世许谁三生凄凉','孤琴候萝·径','書生途','舟遥客','隐隐仙姬','謫仙','眉间黛色','风月客','邀我花前醉','送舟行','公子好风骨','远赴相思','舍身薄凉客','南烟','枭雄戏美人','书向鸿笺','泠泠七弦上','本是荒野客','美人笑眼媚入骨','动情书生','不甚了了','君莫忘','浅山藏','欲言竟无词','相思无人探','桃花纷落','浮生错','笑眼生姿娇','举杯敬风尘','扑流萤','一望几重烟水','南乔枝','一袍清酒付','酒醒三更','未来江山和你','从此江山别','雾尽眉目清','纵马山川剑自提','风月缱绻','青山独往','一壶酒化流年','思契十里','山君与见山','人间朝暮','孤独入客枕','雾锁深情目','妄饮晩冬酒','轻枕海棠','遥寄三山','逃夭','君踏桃花归','眼底桃花色','山河有幸埋战骨','三千妖杀','执伞青衣袖','闯入君怀','醉风吹客衣','饮马桃花时','春色三分','独钓一江月','偏作相思骨','春慵','倚楼听雨','西风乍起','纵花期将误','漫思茶','杯酒困英雄','桃腮带笑','世事堪玩味','此心却寄予','泸沽烟水里的过客','相思劫','门前流水尚能西','自轻舟去','清茶白事欢','若水三千','十八闲客','饮尽盏中余温','让笑意折了枝','山水几程远','北渚','蜀三川','执笔画素颜','写雾词','眉间意难了','書生敬亭山','雲胡不喜','浑似梦中客','平你眉间川','青烟小生','白裙红衣的姑娘','独行千万里','沧桑稚子','林间抚琴者','醉眼望云烟','且将青衫换酒','城南诗客','鸩远一方','提灯晚风','酒意入桃枝','花重月数','白衣酒客','着素衣','酒醒梦迟','拔剑斷情伤','云裳佳人','细呷温酒','君未叹沉香','素酒青衣贤','素手披薄衣','风乎舞雩','南冥有猫','长虹饮涧','春风不识路','眉梢眼角藏欢','一盅浊酒醉方休','南溟大人','茕茕白兔','单衫杏子红','入云栖','卧笑醉伊人','红鸾心动','诗酒露华浓','歌散酒初醒','娇女轻抚琴','抚琴绘长歌','川长思鸟来','窈窕君王妻','何如旧颜','醉卧君子膝','折花载酒少年事','眸是三千嗔','美人轻蔑寡人殇','画扇浅醉染一袭','古城小巷红尘客','西阁的酒','遗城落梦Ω','斟满千杯思','峥嵘岁月长','南山相送','困酣娇眼','鱼雁音书','且共从容','沽酒待人歸','千秋岁','轻拂两袖风尘','蒹葭烫酒','十里长街走马','临风纵欢','酒肆饮几壶','袖ロ生香','青笺画卿颜','青丝挽来生','素衣清颜淡若尘','卿如绿萼','长欢久安','与君醉笑三千场','苍笙踏歌','酒醒梦断','初见与别辞','弦上清辉霜满弧','谢却荼蘼','吾性傲以野','雁素鱼笺','山月不知心底事','只须若为只须君','几许温柔佐酒','余墨残香独自敛','清酒孤欢','相思寄','伴君幽独','戎马安半生','清白小生','韶华洗泪妆','沽酒问卿','浊酒倾觞','青山独归远','江船夜雨听笛','满怀离愁饮','风送渔人到岸','帘卷笙声寂','三寸画锁骨','拟墨画扇','秦桑低绿枝','妙手青丝花前绣','橘落淮南终成枳','料峭春风吹酒醒','醉笑红尘千场','落花人独立','予醉伴花眠','散发膝间对饮酒','明我长相忆','半生輕狂客','几许相思待酒浇','ぃ暮风古榕待人歸','春怀似酒浓','云中寄锦书','挥袂客天涯','淳曲佳人难诉衷肠','对此欢终宴','白露饮尘霜','一曲思君赋','识遍英雄路','我醉欲眠','浊酒杯醉人不醉','为君司南','晚来天欲雪','虎行風捷猎','忍写断肠句','檐底铃声','倾酒向涟漪','京华倦客','狂歌痛饮','眉目艳新月','拢一蓑烟雨','红装而蹇者','朗月清风','长恨春归晚','置酒而臥','清歌花酒','语隔秋烟','低吟归去兮','浪花有意','朝歌夜弦','伴君跳出红尘外','花边载酒','青山隐隐','莫辞酒味薄','声声慢','淫词浪曲','眉目不掩笑意','多情易老ヽ','灬狂酲易醒','望断江南岸','肆酒娼','卿以君歌','花骨埋香','寒玉簪秋水','斯人独醉','枝上绵蛮','细看秦筝','沉醉不知归路','嗟我怀人','蓦地一相逢','画角声中','羁旅长堪醉','吹皱一池春水','取苍穹一隅','朝飞暮卷','空水漫漫','翻恨游丝短','潇洒出风尘','是离愁','听闻君莫笑','离恨悠悠','一笠烟雨','空水漫漫','旧故里草木深','伯人心贤','醉里几时欢','沽酒杯空影','清风可相许','放浪江湖','醉饮千觞不知愁','离人犹未归','望君铭记妾容颜','叶散冰离','幸而勿忘矣','来往不逢人','酒阑人散','白衣渡川','山有扶苏','风劲角弓鸣','开到荼靡','青梅佐以酒','浪子提剑江湖走','更吹落星如雨','未若柳絮','无情有思','歌尽酒','强乐还无味','朱明承夜','风烟倦','古亭白衫少年殇','明朝千里别','微雨打梨花灬','公子姓甚名谁家住何处','羡鱼','蒹葭青衫','清扬婉兮','庸人自庸','清狂','半江戎马与君筹','笙尽缘无','仗剑行诗者','夏醉浅梦','绾发思君','与君长诀','疏狂几曾','词抒笙歌','劝君莫执意','半卷清词','笙歌君独幽','清水漪澜','煑揂壹鬥','一寸光阴，半亩情','美如冠玉','山抹微云','一别两宽，各生欢喜','良辰不负美景','心之忧已，於我归息','醉眼不逢人','无处寄笺','一纸红笺','拟歌先敛，欲笑还颦','良辰','眉眼一袭温良','红袖添香','青衣水袖','阑珊几场','故人难聚','左语','孤存','踽踽独行','棠梨煎雪','独酌陈酿','明月下西楼','予之笑颜','荖葙恏','侠骨柔情摧红颜','清宵尚温','场以散，故人亦相离','画唐轻赋临江仙','卮言','笙歌欢颜','谏书稀','美人迟暮','笙歌醉梦间℃','挽歌渐起','笙歌已沫','山穷水尽更词穷','十夏九黎','明月多情应笑我','┌;亦旧怡心','笙歌歇尽','←琴默千弦︶','君生我未生','此情可待追忆','浪与矜持','诉清风','天下皆白，唯我独黑','清夜深林觅故人','回首寒暄','旧年素颜君记否','堇年伊人倾城','白衫故人','梦里归人','不负相思引','愁恨年年长相似','伊人笑颜依旧','眉目成书','挽歌朽哖','づ羞蘤之容','醉色染红颜','遲暮花未央','一曲离歌﹌泪倾城','素时景年一世疏离','伤丶半世流离','吾皇i','♂风帘残烛隔霜清♂','て瑾色如弦〞','月迷津度，何以忘言','良人情未深','伊人问孤影','ー季樱花﹌落雨殇','紫竹語嫣﹏','君誓与妾三生不弃','晨钟暮鼓','夏末凉城空余心','血染素衣泪倾城','一曲琵琶倾城梦','傾城﹌红顔笑','麯意風華','仰面清风','尔笑为红颜','漫游诗人','琴断ら弦奈何','笛声寒窗影残','朝如青丝暮成雪','ㄨ℉蒊仟嗗℅`','黯然销魂月','挽梦忆笙歌','淡抹\"煙熏妝','莫路繁华终成殇','泼墨画霓裳','霓裳羽衣','画扇悲风殇月夜﹋','宇文庭轩','灬华灯绯伤凉薄人','一羽霓裳等君还','一城柳絮吹成雪','把酒唱别离','你倾城一笑惊绝了多少年华','青衫儰鉨守葔','゛撑一把青伞”','游戏皇帝','墨锦倾城染青衣','时光凉丷春衫薄','黄粱空梦','相思意','浮华乱世许谁三生凄凉','泪如珠美却殇','塔里以南,木河以北','独自空忆成欢','只饮烈酒不谈过往','特洛〆伊','故人载尘而归','浮世清欢','惬允','历日旷久','不惧长久','初安故人','前车之鉴','君醉相思.','一缄书札','老友人.','秋水伊人@','红伞故人.','.〆前世有约今生无缘','◆◇╮陌上花','ヅ花自飘零‵水自流','一季樱花°落满江南','ベ断桥烟雨旧人殇','白头之吟i','一曲离殇','泪如雪','老中医','伊人何故','一马平川','故城','眉目传书','白衣卿相','″一世浮华╮','回眸泪倾↗城','﹏｀尘ㄝ羙╮','oゞ夜色乄未央ぁ','〆乀似水流年|〆乀','凡夫俗子','花间一壶酒','他予吾梦','孤舟残月','吾皇本是俏佳人','酒清浊','吾王美如画!','一战定江山','﹏泪染倾城°','﹎紅顔薄命ぷ','︶烟雨离殇ゐ','夜未央゛樱花落ζ','邈姒┮迋孑','借花献人','ˇ故人西辞-','老旧照片','青山长河','墨羽','月落ヅ乌啼デ','陈年往事','绾发暮年','长伴君侧','芦苇','当時木蘭是女兵№','朕免你一死','活色生香','爱卿领旨','逍遥人世欢','孤愿为汝倾尽天下','浊酒焚','孤枕百年','思君令人老','-梵天','仌俳聖賢','〆竹墨残水烟花冷ゾ','彼岸花开的太美','︶烟雨离殇ゐ','ら醉枫染墨支离碎の','墨城烟柳旧曲绝','把酒言欢','古道印残灯','古韵千秋','闲云清烟','旧年枕上','一丈之内方为夫','深宫萧然〆锁一世清秋','伊人浅笑最倾城','烟花迷离伊人醉','清酒吟','小妾i','女司令','对饮江南雨','无远思近则忧','君入吾心i','惊鸿一瞥','征战四方','无声胜喧言','一字篆刻我们Dē故事','独守空城丶只为你','■岁月流年﹌','▂.黑色礼装','╰つ倾倾城ら','◆陌生的城市╰つ','◢◢梦幻星空◣◣','折扇掩面','血染江山的画','尸骨未寒','一语道破.','傻人有傻福','千古罪人','゛一首日光曲ッ','m回眸泪倾城﹎','大皇帝','踏雪寻梅','帘隐青灯','一久便惯','点缀宫妆面','南巷长歌.','ら浅安时光','墨尔本.晴','繁华落幕','准风月谈㎡┛','先皇已驾崩','﹌倾雪』思念','兮°半岛弥音','一季倾城梦','忆乡客ˇ','青丝发','饮雪煮茶','仦灬最美年华','゛.美好的岁月▂','凄凉月·月怜卿','与妻书','墨染卿裎','白城青鸟.','为伊书','眉间雪.','多行不义必自毙i','阿斯顿马丁one','叶繁终唯枯','状况外　beside▼','Sily°小晴天','imagine°','LuHan','众人皆醉唯我独醒','白空映灯','半旧情怀','旧楼天台','望天边星宿','再回首','记忆的窗景i','墨描熙画','看君拥佳人入怀','如花堪折','只是故人','尔虞我诈','易生玺爱','　入骨相思','水清墨韵','一念初见','听风赏雨','南巷旧人','离人未归','杯中残酒','旧人不归','冷月轻吟','青灯古寺','煙雨過客','逍遙蒗孒','北柠陌寒°','墨染安然','青衫水墨つ','清酒半壶','孤念旧人','墨眉朱砂','菲羽凌曦','杯中残酒','墨染锦年°','寂若安年の','且聽風吟','旧城空巷','青梅煮酒','酒笙清栀','南笙北执','暮色年華丶','忆之沫沫','君临天下','醉枕江山','南巷浅唱','清明雨上','北巷栀酒','泪染素衣','╰☆潇湘妃子ㄣ','旧巷故人','笑拥冷风°','纸鸢栀年','浅夏〆淡殇','断桥残雪','樱雨墨落','清盏孤茶','浮生若梦ヤ','南巷清风','断桥残雪'];

    public function reg_all_nackname_list(){
        exit;
        $n=0;
        foreach ($this->user_nackname_list as $key => $value) {
            $vUser = new vUser();
            $mUser=new mUser();
            $data['user_user']='user_'.substr(md5(rand(1,1000000)),0,6);
            $data['user_pass']=md5(md5(rand(1,1000000)));
            $data['user_nickname']=$value;

            $validateResult = $vUser->scene("login")->check($data);
            if(!$validateResult){
                var_dump($vUser->getError());
                continue;
            }
            $user_has=$mUser->hasUserName($data['user_user']);
            if($user_has){
                continue;
            }
            $user_res=$mUser->reg($data);
            if(!$user_res){
                continue;
            }
            $n+=1;
        }
        var_dump($n);
    }
}
